ТестEDT/src/InformationRegisters/ИспользуемыеКартинки/ИспользуемыеКартинки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользуемыеКартинки</name>
  <resources>
    <name>ДДКартинки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидКартинки</name>
    <type>
      <types>EnumRef.ВидыКартинок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТестEDT/src/Enums/ВидыКартинок/ВидыКартинок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКартинок</name>
  <enumValues>
    <name>ЛоготипМалый</name>
  </enumValues>
  <enumValues>
    <name>ЛоготипБольшой</name>
  </enumValues>
</mdclass:Enum>

ТестEDT/src/CommonForms/ЛоготипКомпании/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЛоготип(Команда)
	Перем Адрес;
	Если ПоместитьФайл(Адрес,"",,Истина,ЭтаФорма.УникальныйИдентификатор) Тогда
		Картинка=Адрес;
		ИзменитьЛоготипНаСервере();
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ИзменитьЛоготипНаСервере()
	ДвоичныеДанные=ПолучитьИзВременногоХранилища(Картинка);
	ХЗ=Новый ХранилищеЗначения(ДвоичныеДанные);
	МЗ=РегистрыСведений.ИспользуемыеКартинки.СоздатьМенеджерЗаписи();
	МЗ.ВидКартинки=Перечисления.ВидыКартинок.ЛоготипМалый;
	МЗ.ДДКартинки=ХЗ;
	МЗ.Записать(Истина);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отбор=Новый Структура("ВидКартинки",Перечисления.ВидыКартинок.ЛоготипМалый); 
	Запись=РегистрыСведений.ИспользуемыеКартинки.Получить(Отбор);
	Картинка1=Запись.ДДКартинки.Получить();
	Картинка=ПоместитьВоВременноеХранилище(Картинка1,ЭтаФорма.УникальныйИдентификатор);
		//Картинка=ПолучитьНавигационнуюСсылку(Константы,"ЛоготипКомпании"); 
КонецПроцедуры
